In [1]:
import pandas as pd

cricket = {'Team': ['India', 'India', 'Australia', 'Australia', 'SA',
   'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
   'Rank': [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,801,891,815,776,784,834,824,758,691,883,782]}
df = pd.DataFrame(cricket)
df

C:\Users\jain1a\Anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\jain1a\Anaconda3\lib\site-packages\numpy\.libs\libopenblas.EL2C6PLE4ZYW3ECEVIV3OXXGRN2NRFM2.gfortran-win_amd64.dll
C:\Users\jain1a\Anaconda3\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
C:\Users\jain1a\Anaconda3\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [ ]:
India 2 - 2014
Australia - 1 - 2014
SA - 1 - 2016
NZ - 1 - 2015

In [ ]:
#Q1. What is the mean Points per team in their lifetime (Rounded to integer value)

In [4]:
# Richa 
m = df.groupby('Team')['Points'].mean()
m = [int(each) for each in m]
m

[853, 819, 777, 804]

In [5]:
# Sharanya 
df.groupby('Team')['Points'].mean().round()

Team
Australia    853.0
India        820.0
NZ           777.0
SA           804.0
Name: Points, dtype: float64

In [6]:
# Mahesh 
df.groupby('Team')['Points'].mean().round()

Team
Australia    853.0
India        820.0
NZ           777.0
SA           804.0
Name: Points, dtype: float64

In [ ]:
#Q2. Rank top 3 team based in their lifetime mean points.

In [10]:
## Abdullah 
df.groupby('Team')['Points'].mean().sort_values(ascending = False).head(3)

Team
Australia    853.000000
India        819.666667
SA           804.500000
Name: Points, dtype: float64

In [16]:
## Aditya 
a = df.groupby('Team')['Points'].mean().round()
a = pd.DataFrame(a).reset_index()
a = a.sort_values(by='Points',ascending=False)
a['Rank'] = [1,2,3,4]
a

        Team  Points  Rank
0  Australia   853.0     1
1      India   820.0     2
3         SA   804.0     3
2         NZ   777.0     4

In [19]:
## Mahesh 
df.groupby('Team')['Points'].mean().sort_values(ascending = False)[:3]

Team
Australia    853.000000
India        819.666667
SA           804.500000
Name: Points, dtype: float64

In [20]:
## Richa 
m = df.groupby('Team')['Points'].mean().sort_values(ascending=False)
print(m[:3])

Team
Australia    853.000000
India        819.666667
SA           804.500000
Name: Points, dtype: float64